# print(type(n1)) 檢查變速type的方式
# 快捷鍵們
# 清除指令 cls
# 註解 ctrl+/
# 執行快捷鍵 ctrl+f5

# # 2維列表、曹狀迴圈
# #列表中又有列表，就是二維列表
# nums =[[0,1,2],[3,4,5],[6,7,8],[9]]

nums =[
    [0,1,2,454,15],
    [3,4,5,13,15],
    [6,7,85,69,79],
    [9,10,11,13,95]
    ]

print(nums[2][3])#[row,行左到右][column.列上到下]

#曹狀迴圈
#row 是行
#column 是列
# #曹狀迴圈
# nums =[
#     [0,1,2,454,15],
#     [3,4,5,13,15],
#     [6,7,85,69,79],
#     [9,10,11,13,95]
#     ]
# for row in nums: #把0,1,2,454,15,3,4,5,13,15....13,95放進去行
#     #print (row)
#     for col in row: #把行的值再拆成每一列
#         print(col)

#三維列表

name = [
    [["vic","jon","aaa"]],
    [["orange","tina","ccc"]],
     [["kkk","aa99a","grgr"]]
       ]

print (name[2][0][1])